{
  "users": [
    {
      "email": "abdulalimrakib53@gmail.com",
      "password": "$2a$10$x6Xyk7/KmbHbDyipmR3.XOnNrN.MSZQfdH0e7DIkASWbMWF89FuRC",
      "name": "Abdul Alim",
      "id": 1
    }
  ],
  "products": [
    {
      "name": "ALDO Lastours",
      "price": 65,
      "productImage": "https://i.ibb.co/9wYfQqh/bag1.jpg",
      "hoverImage": "https://i.ibb.co/DrVcVWX/bag1-Hover.jpg",
      "description": "Imported\nThere's nothing more luxurious than a stunning, timeless clutch. Wear it crossbody or use the wristlet for a hands-free option.\nMade of synthetic materials.\nThis handbag features two compartments, for your essentials and a little more.\nA versatile option this large bag is made for carrying your essentials and a little more. Dimension: 9.4488 x 2.7559 x 6.2992\nRemovable and adjustable strap",
      "offerPercentage": "10",
      "productType": "bag",
      "genderType": "women",
      "onSale": true,
      "id": 1
    },
    {
      "name": "DKNY Women's Everyday Multipurpose Crossbody Handbag",
      "price": 138,
      "productImage": "https://i.ibb.co/d0385BT/bag2.jpg",
      "hoverImage": "https://i.ibb.co/wYXg8fD/bag2-Hover.jpg",
      "description": "Leather\nImported\nPebbled leather clutch with snakeskin detail\nMagnetic closure",
      "offerPercentage": "15",
      "productType": "bag",
      "genderType": "women",
      "onSale": true,
      "id": 2
    },
    {
      "name": "DKNY Pandora Crossbody",
      "price": 129,
      "productImage": "https://i.ibb.co/2gMR6gZ/bag3.jpg",
      "hoverImage": "https://i.ibb.co/wQ7xtK0/bag3-Hover.jpg",
      "description": "100% Polyurethane\nImported\nStylish Features: pandora crossbody, crossbody\n13 X 8 X 4.5\nExude confidence: Flaunt this handbag for women made to pair with any style; the perfectly small handbag for any occasion from vacation to everyday wear\n0\n0",
      "offerPercentage": "",
      "productType": "bag",
      "genderType": "women",
      "onSale": false,
      "id": 3
    },
    {
      "name": "DKNY Peyton Camera Bag",
      "price": 178,
      "productImage": "https://i.ibb.co/V3BBtMb/bag4.jpg",
      "hoverImage": "https://i.ibb.co/30032PV/bag4-Hover.jpg",
      "description": "100% Polyurethane with Polyvinyl Chloride trim\nImported\nOccasion: This stylish DKNY bag is suitable for various occasions, can be matched with various styles to show your style in many settings. Daily use can also give play to women's elegance.\nMeasurements: 10.5 X 6.625 X 3.375\nSecurity and style: Keep your valuables safe with magnetic flap closure and interior zipper pocket",
      "offerPercentage": "",
      "productType": "bag",
      "genderType": "women",
      "onSale": false,
      "id": 4
    },
    {
      "name": "DKNY Odette Camera Bag",
      "price": 169,
      "productImage": "https://i.ibb.co/tPSh6bz/bag5.jpg",
      "hoverImage": "https://i.ibb.co/sQCzBBL/bag5-Hover.jpg",
      "description": "100% Polyurethane\nImported\nOccasion: This stylish DKNY bag is suitable for various occasions, can be matched with various styles to show your style in many settings. Daily use can also give play to women's elegance.\nMeasurements: 8.25 X 5 X 2.625\nSecurity and style: Keep your valuables safe with magnetic flap closure and interior zipper pocket",
      "offerPercentage": "12",
      "productType": "bag",
      "genderType": "women",
      "onSale": true,
      "id": 5
    },
    {
      "name": "Hanes Women's Crewneck Sweatshirt, EcoSmart Fleece Women's Pullover Sweatshirt, Sweatshirt for Women",
      "price": 14,
      "productImage": "https://i.ibb.co/sQp1X0Q/wCloth.jpg",
      "hoverImage": "https://i.ibb.co/34TqCf3/w-Cloth-Hover.jpg",
      "description": "50% Cotton, 50% Polyester\nImported\nPull On closure\nMachine Wash\nFASHION TO FEEL GOOD ABOUT - Hanes EcoSmart mid-weight, year-round sweatshirt for women is made with cotton sourced from American farms.\nSOFT, PLUSH, AND MADE TO STAY THAT WAY - Thick fleece women's pullover sweatshirt stays warm and cozy, so it can be a longtime favorite.\nTHE CLASSIC LOOK YOU WANT - This women's sweatshirt has a classic silhouette and ribbed details at the collar, cuffs, and waistband that stretch to keep you comfortable.",
      "offerPercentage": "",
      "productType": "cloth, sweatshirt",
      "genderType": "women",
      "onSale": false,
      "id": 6
    },
    {
      "name": "Champion womens Powerblend Relaxed Hoodie for Women,hooded Sweatshirts for Women, Script",
      "price": 52,
      "productImage": "https://i.ibb.co/f4F6fhd/wCloth2.jpg",
      "hoverImage": "https://i.ibb.co/dQRWP2S/w-Cloth2-Hover.jpg",
      "description": "50% Polyester, 50% Cotton\nImported\nPull On closure\nMachine Wash\nMADE FOR COMFORT - Our women's hoodie is made with 9 oz. blended cotton/polyester fleece and offers a loose fit for added comfort.\nEXCEPTIONALLY SOFT AND RELIABLE - Our comfortable women's hoodies are made with a higher stitch for a made-to-last fit!\nFASHION TO FEEL GOOD ABOUT - A percentage of recycled fibers were used in the making of this comfortable women's hoodie.",
      "offerPercentage": "",
      "productType": "cloth, sweatshirt, hoodie",
      "genderType": "women",
      "onSale": false,
      "id": 7
    },
    {
      "name": "Lee Women's Legendary Long Sleeve Boyfriend Cropped Tee",
      "price": 24,
      "productImage": "https://i.ibb.co/fpr4mzy/wCloth3.jpg",
      "hoverImage": "https://i.ibb.co/W0NJdqP/w-Cloth3-Hover.jpg",
      "description": "50% Cotton, 50% Polyester\nImported\nPullover closure\nMachine Wash\nCROP TEE. Perfectly cropped, this scoop-neck boyfriend tee is one comfortable wardrobe staple no one should go without.\nALL-DAY COMFORT. Best of all, this long sleeve knit t-shirt is made of comfy cotton fabric or a cotton-poly blend (depending on colorway) that's soft to the touch and easy to love.\nBOLD GRAPHICS. This long sleeve shirt is available in a couple different bold prints that add a premium finish to your favorite cropped tee.",
      "offerPercentage": "21",
      "productType": "cloth, sweatshirt",
      "genderType": "women",
      "onSale": true,
      "id": 8
    },
    {
      "name": "Lee Women's Legendary Regular Fit Jacket",
      "price": 42,
      "productImage": "https://i.ibb.co/17z6DGb/wCloth4.jpg",
      "hoverImage": "https://i.ibb.co/7yg8VyR/w-Cloth4-Hover.jpg",
      "description": "99% Cotton, 1% Elastane\nImported\nButton closure\nMachine Wash\nREGULAR FIT. This timeless denim jacket comes in a regular fit and hits just below the natural waist for a relaxed look. Stretch denim fabric moves with you for comfort.\nSTRETCH FABRIC. Made with a stretch cotton blend, this denim jacket has just enough flexibility to let you move without restriction.\nEVERYDAY CLASSIC. This jacket features iconic details with dual Lee button-flap pockets and two front side pockets. Lee buttons and a small Lee patch add a signature look.",
      "offerPercentage": "18",
      "productType": "cloth, jacket",
      "genderType": "women",
      "onSale": true,
      "id": 9
    },
    {
      "name": "andy & natalie Women's Denim Jackets Oversize Long Sleeve Basic Button Down Jean Jacket with Pockets",
      "price": 32.99,
      "productImage": "https://i.ibb.co/w0xCQhN/wCloth5.jpg",
      "hoverImage": "https://i.ibb.co/8rmL3vT/w-Cloth5-Hover.jpg",
      "description": "100% Cotton\nImported\nButton closure\nMachine Wash\n100% COTTON MATERAL: Our Women Jean Jacket is Made of 100% Cotton, This Denim Jean Jackets is made of soft and comfortable fabric, Durable Denim offers comfort, mobility, and versatility. This denim jacket offers a unique range of motion for guaranteed comfort.\nCROPPED JACKETS FEATURE: Constructed with comfort in mind, this women's jean jackets has a classic fit. Collar, Rolled long sleeve, Two chest pockets, Cropped length, slim-fit cut, button closure, Boyfriend style, this oversize denim jackes for women has easy-access storage for all of your basic necessities.You can also give this demin jean jackets as a gift to your mother, girlfriend, relatives.\nVARIOUS OCCASIONS: This cropped denim jackets for ladies is perfect for various occasions: business, wear to work, office, shopping, vacation, holiday, casual, picnic, rockabilly, festival, solemnity, celebration, wedding party and casual daily life. Wear it out to lunch with friends or dress it up for date night, this essential staple can be worn for many occasions. Womens crop jean jackets makes you possible to look slimmer, flattering and conjures a beautiful figure",
      "offerPercentage": "",
      "productType": "cloth, jacket",
      "genderType": "women",
      "onSale": false,
      "id": 10
    },
    {
      "name": "Carhartt Men's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt",
      "price": "24",
      "productImage": "https://i.ibb.co/PrGRTbL/men1.jpg",
      "hoverImage": "https://i.ibb.co/DWS28Ty/men1-Hover.jpg",
      "description": "Solids: 100% cotton; Heather Gray: 90% cotton, 10% polyester; All other heathers , neps, Brite Lime and Brite Orange: 60% cotton, 40% polyester\nImported\nPull On closure\nMachine Wash\nRib-knit crewneck\nSide-seamed construction minimizes twisting\nLeft-chest pocket with sewn-on Carhartt label\nTagless neck label",
      "offerPercentage": "20",
      "productType": "sleeve, cloth",
      "genderType": "men",
      "onSale": false,
      "id": 11
    },
    {
      "name": "Hanes Beefy-T Long Sleeve Henley",
      "price": "15.99",
      "productImage": "https://i.ibb.co/PQt5Zdk/men2.jpg",
      "hoverImage": "https://i.ibb.co/1R34Tt4/men2-Hover.jpg",
      "description": "100% Cotton\nImported\nButton closure\nMachine Wash\nHANES QUALITY – Men’s Henleys are made with a high-density stitch count, double-needle stitching, and shoulder-to-shoulder taping for extra strong seams.\nHENLEY STYLE - These Hanes men's cotton t-shirts boast a rounded neckline, three-button placket, and long sleeves.\nCOTTON GOODNESS - Soft and strong 6-oz. ring-spun cotton feels great for comfort that lasts.",
      "offerPercentage": "",
      "productType": "sleeve, cloth",
      "genderType": "men",
      "onSale": false,
      "id": 12
    },
    {
      "name": "Joe's Jeans Men's Long Sleeve Wintz Henley",
      "price": "40",
      "productImage": "https://i.ibb.co/3YT8bDp/men3.jpg",
      "hoverImage": "https://i.ibb.co/RccpsKv/men3-Hover.jpg",
      "description": "100% Cotton\nMade in US\nButton closure\nMachine Wash\nTonal stitching\nSuper soft hand",
      "offerPercentage": "30",
      "productType": "sleeve, cloth",
      "genderType": "men",
      "onSale": true,
      "id": 13
    },
    {
      "name": "Joe's Jeans Men's The Asher",
      "price": "63",
      "productImage": "https://i.ibb.co/gtsSBVr/men4.jpg",
      "hoverImage": "https://i.ibb.co/0Xpg5SS/men4-Hover.jpg",
      "description": "80% Cotton, 18% lyocell, 2% elastane DENIM BOTTOMS\nImported\nZipper closure\nMachine Wash\nFASHIONABLE JEANS FOR MEN: Make a statement without sacrificing comfort with our Asher men’s jean. Stylish and made from high-quality materials, these slim-fit jeans for men are ideal for dressing up or keeping it casual.\nTHE RIGHT FIT: This jean for men combines a great look with a great fit. Featuring a mid-rise waist with a slim, modern fit from the hip to the leg opening and a bit of stretch for a trendy slim-leg profile.\nELEVATED STYLE & QUALITY: These slim jeans for men are made from a high-quality 11-ounce stretch denim with a cotton-and-spandex blend. Each jean wash features unique details with expert stitching and a classic 5-pocket design",
      "offerPercentage": "",
      "productType": "jeans, cloth",
      "genderType": "men",
      "onSale": true,
      "id": 14
    },
    {
      "name": "Joe's Jeans Men's Brixton Straight and Narrow Jean in Mccowen Colors",
      "price": "101",
      "productImage": "https://i.ibb.co/4SK3myd/men5.jpg",
      "hoverImage": "https://i.ibb.co/XVfqZ6V/men5-Hover.jpg",
      "description": "79% Cotton, 18% Modal, 3% Elastane\nImported\nZipper closure\nMachine Wash\nFASHIONABLE TWILL PANTS: Make a statement without sacrificing comfort with our Brixton men’s pants. Stylish and made from high-quality materials, these straight and narrow–fit pants for men are ideal for dressing up or keeping it casual.\nTHE RIGHT FIT: These dress pants men will love combine great looks with a great fit. Featuring a mid-rise waist with a straight, modern fit, they have narrow tailored legs and a bit of stretch for a trendy profile.\nELEVATED STYLE & QUALITY: These straight-leg pants are made from a high-quality cotton, modal, and elastane fabric blend. They’re garment dyed for understated color and have subtly lightened seams and edges to complete the",
      "offerPercentage": "",
      "productType": "jeans, cloth",
      "genderType": "men",
      "onSale": false,
      "id": 15
    },
    {
      "name": "Dr. Brown’s Natural Flow® Anti-Colic Options+™ Narrow Baby Bottles 8 oz/250 mL, with Level 1 Slow Flow Nipple, 4 Pack, 0m+",
      "price": "25",
      "productImage": "https://i.ibb.co/Kbmzj43/baby.jpg",
      "hoverImage": "https://i.ibb.co/s5FZJZQ/baby-Hover.jpg",
      "description": "ANTI-COLIC BABY BOTTLE. Anti-Colic internal vent system is clinically proven to reduce colic. Decreases spit-up, burping and gas.\nCONSISTENT FLOW RATE. Vacuum-free feeding is closest to breastfeeding and Dr. Brown’s silicone nipples provide a consistent flow so babies can feed at their own pace.\nPRESERVES NUTRIENTS. The anti-colic vent system is proven to help preserve bottle milk nutrients and aids in digestion for a better night’s sleep.\nBREASTFEEDING BOTTLE. The breast-like nipple shape encourages a proper latch for a more natural bottle feeding experience and eases the transition from breast to bottle and back again.\nBOTTLE GROWS WITH BABY. Dr. Brown’s Natural Flow Anti-Colic Options+ baby bottle works best with the internal vent system in place but can be removed as baby’s feeding develops – no need to introduce a different bottle.\nSUSTAINABLE BABY BOTTLE. Dr. Brown’s Narrow bottle is designed to nourish through all of baby’s feeding stages and is recyclable.",
      "offerPercentage": "",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": false,
      "id": 16
    },
    {
      "name": "Dr. Brown's HappyPaci 100% Silicone Pacifier 0-6m, BPA Free, Black, Cool Gray, White, 3 Pack",
      "price": "5",
      "productImage": "https://i.ibb.co/QvGpsrZ/baby1.jpg",
      "hoverImage": "https://i.ibb.co/sbWtDmw/baby1-Hover.jpg",
      "description": "SILICONE BABY PACIFIER. Soothe baby with lightweight and soft 100% silicone pacifier. BPA-free, one-piece construction designed for babies 0-6 months.\nCONTOURED COMFORTABLE SHIELD. The one-piece construction of the HappyPaci features a contoured butterfly-shaped shield for comfort. The shield curves away from baby’s face, providing plenty of room for little noses and cheeks.\nEASY TRANSITION TO PACIFIER. The unique 100% silicone HappyPaci design features the same shape as the Dr. Brown’s bottle nipple that’s familiar to baby.",
      "offerPercentage": "",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": true,
      "id": 17
    },
    {
      "name": "Chicco PhysioForma® 100% Soft Silicone One Piece Pacifier for Babies 0-6m, Orthodontic Nipple, BPA-Free, 4-Count with Sterilizing Case,4 Count (Pack of 1)",
      "price": "11",
      "productImage": "https://i.ibb.co/wrWw0zw/baby2.jpg",
      "hoverImage": "https://i.ibb.co/D17wsPB/baby2-Hover.jpg",
      "description": "Actively supports baby’s breathing\nClinically developed, tested, and approved in partnership with an advisory panel of leading neonatologists, pediatricians, and orthodontists. BPA and Latex Free.\nExtra-soft, satin-textured silicone nipple for more comfort and less slip\nVentilation holes for air circulation help prevent the gathering of saliva\nLateral curve of the nipple evenly distributes the tongue’s pressure against the palate",
      "offerPercentage": "",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": true,
      "id": 18
    },
    {
      "name": "Graco Pack 'n Play Travel Dome LX Playard | Includes Portable Bassinet, Full-Size Infant Bassinet, and Diaper Changer, Leyton",
      "price": "399",
      "productImage": "https://i.ibb.co/yYSt3gc/baby4.jpg",
      "hoverImage": "https://i.ibb.co/3pFStzh/baby4-Hover.jpg",
      "description": "Portable Dome Bassinet can be used on or off the playard, so you can keep baby by your side wherever you go\nThe Travel Dome folds compactly and includes its own carry bag so it’s easy and convenient to take on the go.Care & Cleaning: Spot or Wipe Clean, Machine Wash\nPortable, raised bassinet positions baby at your eye level for check-ins through the night without having to get out of bed\nLarge canopy on bassinet features UV 50 protection to shield baby from the sun and keep cool\nFull-size infant bassinet provides an easy-to-reach and easy-to-view spot for your baby to sleep",
      "offerPercentage": "",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": false,
      "id": 19
    },
    {
      "name": "Carter's Baby Boys' Organic Cotton Wrap Sleep & Play",
      "price": "13",
      "productImage": "https://i.ibb.co/GFHht9f/baby5.jpg",
      "hoverImage": "https://i.ibb.co/2PMqKjX/baby5-Hover.jpg",
      "description": "100% Cotton\nImported\nSnap closure\nMachine Wash\nCertified organic by the Global Organic Textile Standard (GOTS)\nSleep N Play for baby\nWarm wrap design\nFabric type: 100% Cotton",
      "offerPercentage": "",
      "productType": "cloth",
      "genderType": "baby",
      "onSale": true,
      "id": 20
    },
    {
      "name": "Little Planet by Carter's Baby 6-pack Organic Cotton Short-sleeve Rib Bodysuits",
      "price": "29",
      "productImage": "https://i.ibb.co/0F7FcNW/baby6.jpg",
      "hoverImage": "https://i.ibb.co/qY460HY/baby6-Hover.jpg",
      "description": "100% Cotton\nImported\nSnap closure\nMachine Wash\nCertified organic by the Global Organic Textile Standard (GOTS)\n6-pack bodysuits for baby\nOverlap shoulders\nSnaps at the leg that make for super easy changes",
      "offerPercentage": "10",
      "productType": "cloth",
      "genderType": "baby",
      "onSale": true,
      "id": 21
    },
    {
      "name": "Cosco Play-in-Place Stationary Activity Center, 6 Engaging Toys and a 360° Rotating seat, 3-Position Height Adjustment Machine-Washable, Removable seat pad, Rainbow",
      "price": "78",
      "productImage": "https://i.ibb.co/jHrSgJb/baby7.jpg",
      "hoverImage": "https://i.ibb.co/Fw5Xrwc/baby7-Hover.jpg",
      "description": "Cosco Play-in-Place Stationary Activity Center, 6 Engaging Toys and a 360° Rotating seat, 3-Position Height Adjustment Machine-Washable, Removable seat pad, Rainbow",
      "offerPercentage": "10",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": true,
      "id": 22
    },
    {
      "name": "Cosco Rocking Bassinet with Play Yard DLX, Rainbow",
      "price": "115",
      "productImage": "https://i.ibb.co/28ybPj6/baby8.jpg",
      "hoverImage": "https://i.ibb.co/YLg1jhm/baby8-Hover.jpg",
      "description": "REST OR PLAY AT HOME OR AWAY With the Cosco Rocking Bassinet with Play Yard DLX, your little one will rest easy at home or anywhere you travel. When your baby is up and smiling, the bassinet easily converts to a play yard.\nROCK LITTLE ONES TO SLEEP This cozy bassinet, has a padded floor mat for extra comfort. Gently lull your baby to sleep in rocking mode. Or choose to secure in place for stationary mode before laying baby down.\nEVERYDAY PLAY Your baby can explore in a safe space, while you enjoy a moment to yourself. The play yard’s see-through mesh sides offer increased air flow, and let you easily check in on your little one.",
      "offerPercentage": "",
      "productType": "accessories",
      "genderType": "baby",
      "onSale": false,
      "id": 23
    }
  ]
}